; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-6-26)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p1-2 - location
	p3-0 - location
	p3-4 - location
	p3-5 - location
	p4-5 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s5)
	(at driver4 s4)
	(at driver5 s4)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s5)
	(empty truck6)
	(at package1 s2)
	(at package2 s1)
	(at package3 s0)
	(at package4 s2)
	(at package5 s3)
	(at package6 s1)
	(at package7 s2)
	(at package8 s5)
	(at package9 s2)
	(at package10 s2)
	(at package11 s2)
	(at package12 s0)
	(at package13 s0)
	(at package14 s1)
	(at package15 s2)
	(at package16 s4)
	(at package17 s2)
	(at package18 s1)
	(at package19 s2)
	(at package20 s2)
	(at package21 s2)
	(at package22 s1)
	(at package23 s2)
	(at package24 s0)
	(at package25 s3)
	(at package26 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(link s0 s2)
	(link s2 s0)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s3)
	(link s3 s1)
	(link s2 s3)
	(link s3 s2)
	(link s3 s5)
	(link s5 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s0)
	(at truck1 s1)
	(at truck3 s2)
	(at truck4 s1)
	(at truck5 s4)
	(at package1 s3)
	(at package3 s1)
	(at package4 s5)
	(at package5 s0)
	(at package6 s5)
	(at package7 s3)
	(at package8 s5)
	(at package9 s0)
	(at package10 s0)
	(at package11 s2)
	(at package12 s3)
	(at package13 s3)
	(at package14 s0)
	(at package15 s3)
	(at package16 s5)
	(at package17 s2)
	(at package18 s2)
	(at package19 s4)
	(at package20 s0)
	(at package21 s3)
	(at package22 s4)
	(at package23 s5)
	(at package24 s0)
	(at package25 s2)
	(at package26 s1)
	))


)

; plan
1. (board-truck driver5 s4 truck2)
   deleted: (at driver5 s4) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 6 of 33
2. (drive-truck driver5 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 6 of 33
3. (load-truck s1 package6 truck2)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   goals met: 6 of 33
4. (drive-truck driver5 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 6 of 33
5. (load-truck s4 package16 truck2)
   deleted: (at package16 s4)
   added: (in package16 truck2)
   goals met: 6 of 33
6. (drive-truck driver5 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 6 of 33
7. (load-truck s0 package3 truck2)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 6 of 33
8. (drive-truck driver5 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 6 of 33
9. (drive-truck driver5 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 6 of 33
10. (unload-truck s1 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   goals met: 7 of 33
11. (drive-truck driver5 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 7 of 33
12. (load-truck s3 package5 truck2)
   deleted: (at package5 s3)
   added: (in package5 truck2)
   goals met: 7 of 33
13. (drive-truck driver5 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 7 of 33
14. (drive-truck driver5 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 7 of 33
15. (unload-truck s0 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   goals met: 8 of 33
16. (load-truck s0 package13 truck2)
   deleted: (at package13 s0)
   added: (in package13 truck2)
   goals met: 8 of 33
17. (drive-truck driver5 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 8 of 33
18. (drive-truck driver5 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 8 of 33
19. (drive-truck driver5 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 8 of 33
20. (load-truck s3 package25 truck2)
   deleted: (at package25 s3)
   added: (in package25 truck2)
   goals met: 8 of 33
21. (drive-truck driver5 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 8 of 33
22. (load-truck s2 package9 truck2)
   deleted: (at package9 s2)
   added: (in package9 truck2)
   goals met: 8 of 33
23. (load-truck s2 package7 truck2)
   deleted: (at package7 s2)
   added: (in package7 truck2)
   goals met: 8 of 33
24. (load-truck s2 package4 truck2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   goals met: 8 of 33
25. (unload-truck s2 package25 truck2)
   deleted: (in package25 truck2)
   added: (at package25 s2)
   goals met: 9 of 33
26. (load-truck s2 package23 truck2)
   deleted: (at package23 s2)
   added: (in package23 truck2)
   goals met: 9 of 33
27. (load-truck s2 package21 truck2)
   deleted: (at package21 s2)
   added: (in package21 truck2)
   goals met: 9 of 33
28. (load-truck s2 package20 truck2)
   deleted: (at package20 s2)
   added: (in package20 truck2)
   goals met: 9 of 33
29. (load-truck s2 package19 truck2)
   deleted: (at package19 s2)
   added: (in package19 truck2)
   goals met: 9 of 33
30. (drive-truck driver5 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 9 of 33
31. (unload-truck s5 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s5)
   goals met: 10 of 33
32. (unload-truck s5 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s5)
   goals met: 11 of 33
33. (unload-truck s5 package23 truck2)
   deleted: (in package23 truck2)
   added: (at package23 s5)
   goals met: 12 of 33
34. (unload-truck s5 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s5)
   goals met: 13 of 33
35. (drive-truck driver5 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 13 of 33
36. (unload-truck s0 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s0)
   goals met: 14 of 33
37. (drive-truck driver5 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 14 of 33
38. (drive-truck driver5 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 14 of 33
39. (load-truck s1 package22 truck2)
   deleted: (at package22 s1)
   added: (in package22 truck2)
   goals met: 14 of 33
40. (load-truck s1 package18 truck2)
   deleted: (at package18 s1)
   added: (in package18 truck2)
   goals met: 14 of 33
41. (drive-truck driver5 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 14 of 33
42. (drive-truck driver5 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 14 of 33
43. (unload-truck s2 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s2)
   goals met: 15 of 33
44. (load-truck s2 package15 truck2)
   deleted: (at package15 s2)
   added: (in package15 truck2)
   goals met: 15 of 33
45. (load-truck s2 package10 truck2)
   deleted: (at package10 s2)
   added: (in package10 truck2)
   goals met: 15 of 33
46. (load-truck s2 package1 truck2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 15 of 33
47. (board-truck driver3 s5 truck6)
   deleted: (at driver3 s5) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 15 of 33
48. (drive-truck driver5 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 15 of 33
49. (unload-truck s3 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   goals met: 16 of 33
50. (unload-truck s3 package21 truck2)
   deleted: (in package21 truck2)
   added: (at package21 s3)
   goals met: 17 of 33
51. (unload-truck s3 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s3)
   goals met: 18 of 33
52. (drive-truck driver5 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 18 of 33
53. (drive-truck driver5 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 18 of 33
54. (drive-truck driver5 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 18 of 33
55. (unload-truck s0 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s0)
   goals met: 19 of 33
56. (load-truck s0 package12 truck2)
   deleted: (at package12 s0)
   added: (in package12 truck2)
   goals met: 19 of 33
57. (drive-truck driver5 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 19 of 33
58. (drive-truck driver5 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 19 of 33
59. (load-truck s1 package14 truck2)
   deleted: (at package14 s1)
   added: (in package14 truck2)
   goals met: 19 of 33
60. (drive-truck driver5 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 19 of 33
61. (drive-truck driver5 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 19 of 33
62. (drive-truck driver3 s5 s0 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s0)
   goals met: 19 of 33
63. (board-truck driver4 s4 truck3)
   deleted: (at driver4 s4) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 19 of 33
64. (board-truck driver1 s2 truck4)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 19 of 33
65. (drive-truck driver4 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 19 of 33
66. (drive-truck driver3 s0 s2 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s2)
   goals met: 19 of 33
67. (disembark-truck driver3 s2 truck6)
   deleted: (driving driver3 truck6)
   added: (at driver3 s2) (empty truck6)
   goals met: 20 of 33
68. (disembark-truck driver4 s0 truck3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s0) (empty truck3)
   goals met: 21 of 33
69. (drive-truck driver1 s2 s0 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   goals met: 21 of 33
70. (board-truck driver2 s2 truck6)
   deleted: (at driver2 s2) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 21 of 33
71. (drive-truck driver2 s2 s3 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   goals met: 21 of 33
72. (disembark-truck driver2 s3 truck6)
   deleted: (driving driver2 truck6)
   added: (at driver2 s3) (empty truck6)
   goals met: 22 of 33
73. (drive-truck driver1 s0 s4 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   goals met: 22 of 33
74. (drive-truck driver1 s4 s1 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 23 of 33
75. (disembark-truck driver1 s1 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 23 of 33
76. (walk driver1 s1 p0-1)
   deleted: (at driver1 s1)
   added: (at driver1 p0-1)
   goals met: 23 of 33
77. (drive-truck driver5 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 23 of 33
78. (unload-truck s0 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s0)
   goals met: 24 of 33
79. (drive-truck driver5 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 24 of 33
80. (drive-truck driver5 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 24 of 33
81. (drive-truck driver5 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 24 of 33
82. (unload-truck s3 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s3)
   goals met: 25 of 33
83. (drive-truck driver5 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 25 of 33
84. (drive-truck driver5 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 25 of 33
85. (unload-truck s4 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s4)
   goals met: 26 of 33
86. (drive-truck driver5 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 26 of 33
87. (drive-truck driver5 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 26 of 33
88. (unload-truck s3 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s3)
   goals met: 27 of 33
89. (drive-truck driver5 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 27 of 33
90. (drive-truck driver5 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 27 of 33
91. (unload-truck s4 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s4)
   goals met: 28 of 33
92. (drive-truck driver5 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 28 of 33
93. (unload-truck s0 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s0)
   goals met: 29 of 33
94. (board-truck driver4 s0 truck5)
   deleted: (at driver4 s0) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 28 of 33
95. (drive-truck driver4 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 29 of 33
96. (disembark-truck driver5 s0 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s0) (empty truck2)
   goals met: 29 of 33
97. (board-truck driver5 s0 truck3)
   deleted: (at driver5 s0) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 29 of 33
98. (unload-truck s0 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   goals met: 29 of 33
99. (walk driver1 p0-1 s0)
   deleted: (at driver1 p0-1)
   added: (at driver1 s0)
   goals met: 30 of 33
100. (drive-truck driver5 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 31 of 33
101. (drive-truck driver4 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 30 of 33
102. (load-truck s0 package1 truck5)
   deleted: (at package1 s0)
   added: (in package1 truck5)
   goals met: 30 of 33
103. (drive-truck driver4 s0 s5 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s5)
   goals met: 30 of 33
104. (drive-truck driver4 s5 s3 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   goals met: 30 of 33
105. (unload-truck s3 package1 truck5)
   deleted: (in package1 truck5)
   added: (at package1 s3)
   goals met: 31 of 33
106. (disembark-truck driver4 s3 truck5)
   deleted: (driving driver4 truck5)
   added: (at driver4 s3) (empty truck5)
   goals met: 31 of 33
107. (walk driver4 s3 p3-0)
   deleted: (at driver4 s3)
   added: (at driver4 p3-0)
   goals met: 31 of 33
108. (walk driver4 p3-0 s0)
   deleted: (at driver4 p3-0)
   added: (at driver4 s0)
   goals met: 32 of 33
109. (board-truck driver2 s3 truck5)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 31 of 33
110. (drive-truck driver2 s3 s5 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   goals met: 31 of 33
111. (drive-truck driver2 s5 s4 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   goals met: 32 of 33
112. (disembark-truck driver2 s4 truck5)
   deleted: (driving driver2 truck5)
   added: (at driver2 s4) (empty truck5)
   goals met: 32 of 33
113. (walk driver2 s4 p3-4)
   deleted: (at driver2 s4)
   added: (at driver2 p3-4)
   goals met: 32 of 33
114. (walk driver2 p3-4 s3)
   deleted: (at driver2 p3-4)
   added: (at driver2 s3)
   goals met: 33 of 33
